{
  "entries": [
    {
      "sortOrder": 1,
      "sectionName": "Summary",
      "data": [
        {
          "detailsHTML": "Hi, I’m Justin Robinson. A Software Development Engineer (SDE) for Amazon.com. Specifically I work on a team called Post Delivery Experience. We own two things. The first being what started our team, <a href=\"https://www.amazon.com/b/?node=17738977011\">Ship-to-Store</a>. We enable customers to utilize third party service providers that improve their <i>post delivery experience</i>. The second is a patented internal technical solution to a problem that remained unsolved until we launched Ship-to-Store. We’ll call this STSTech. STSTech enables several teams (including mine) and orgs to build their experiences and products both domestically and internationally. We don’t take ourselves too seriously and we’re not afraid to ask for forgiveness. We’re constantly having to do jobs outside of our scope of responsibility and have gained a reputation for finding and fixing problems we don’t own. Every person on my team is capable of leading a project from a business and technical standpoint; a rare feat at a company our size (not to mention the tactful deal slinging product manager we have). I love my team."
        }
      ]
    },
    {
      "sortOrder": 2,
      "sectionName": "Experience",
      "data": [
        {
          "title": "Amazon.com",
          "detailsHTML": "<ul><li>Independently discovered and drove solution to multi-billion dollar company wide bug</li><li>Pioneered Amazon full-time remote employee program after working in Seattle for one year</li><li>Collaborated with partner team in India to deliver customer centric Ship-to-Store shopping experiences</li><li>Independently discovered and solved technical internationalization hurdles that had plagued Amazon for 20 years</li><li>Orchestrated decoupling of local US client team code bases and deployment processes from remote India based teams</li><li>Mentored intern on an ambiguous project where he had little experience. Led him to a successful project execution plan and job offer from Amazon </li></ul>",
          "imageName": "amazon.png",
          "headerRightSubtitle": "Seattle, WA - Remote in Lancaster, SC since Sept 2017",
          "headerRightTitle": "Oct 2016 - Present",
          "subtitle": "Software Development Engineer"
        },
        {
          "title": "American City Business Journals",
          "detailsHTML": "<ul><li>Increased performance, reliability, maintainability, and iteration speed by migrating internal code bases to my self built <a href=\"https://github.com/justin-robinson/scoop\">PHP Scoop ORM</a></li><li>Rearchitected internal data platform to easily handle incremental changes</li><li>Built Restful Hypermedia HAL api for data platform</li><li>Optimized speed of offline data import and export processes by a factor of 100</li><li>Built Newsleads backbone.js app to monetize contacts from our in-house data platform</li><li>Built web apps using Zend PHP Framework</li><li>Built <a href=\"https://github.com/justin-robinson/reposync\">concurrent code syncing tool using Golang</a></li></ul>",
          "imageName": "acbj.png",
          "headerRightSubtitle": "Charlotte, NC",
          "headerRightTitle": "Jan 2016 - Oct 2016",
          "subtitle": "Software Engineer"
        },
        {
          "title": "Crowell Systems",
          "detailsHTML": "<ul><li>Optimized and fixed PHP web portal for medical patients</li><li>Redesigned in house networking and computing infrastructure</li><li>Established code versioning with git</li><li>Increased patient usage of web portal</li></ul>",
          "imageName": "crowell.png",
          "headerRightSubtitle": "Charlotte, NC",
          "headerRightTitle": "Oct 2015 - Jan 2016",
          "subtitle": "Programmer"
        },
        {
          "title": "Red Ventures",
          "detailsHTML": "<ul><li>Designed and developed web applications using PHP, MySQL, JavaScript, node, and Redis</li><li>Designed and built survey system with over 30,000 questions answered</li><li>Redesigned and coordinated launch of high traffic websites</li><li>Tracked customer experience with multiple JavaScript libraries for added insight</li><li>Collaborated with business analyst to deliver best possible experience to customers</li><li>Served as mentor to high school students</li></ul>",
          "imageName": "rv.png",
          "headerRightSubtitle": "Fort Mill, SC",
          "headerRightTitle": "Aug 2014 - July 2015",
          "subtitle": "Software Engineer"
        },
        {
          "title": "Scientific Research Corporation",
          "detailsHTML": "<ul><li>Designed and developed OO Java applications</li><ul><li>Full UI design</li><li>Full backend design</li></ul><li>Improved existing Ruby on Rails applications</li><ul><li>Revamped web UI</li><li>Improved and added to functionality</li></ul><li>Developed methods for mass hardware security deployment</li><li>Worked in tandem with Scrum team to identify security and functionality bugs</li></ul>",
          "imageName": "src.png",
          "headerRightSubtitle": "Charleston, SC",
          "headerRightTitle": "Sept 2013 - April 2014",
          "subtitle": "Engineer I"
        },
        {
          "title": "Lifecycle Engineering",
          "detailsHTML": "<ul><li>Installed and configured a virtualized network infrastructure using VMware ESX 5i</li><li>Installed and configured a firewall to separate the virtual infrastructure with the physical network infrastructure.</li><li>Installed and configured Windows and Linux virtual machines Developed with Groovy & Grails</li></ul>",
          "imageName": "lce.png",
          "headerRightSubtitle": "Charleston, SC",
          "headerRightTitle": "June 2013 - Sept 2013",
          "subtitle": "Engineering Intern"
        },
        {
          "title": "JRob Computers",
          "detailsHTML": "<ul><li>Server setup and maintenance (Ubuntu Server 9.04-11.04/ Windows Server 20082012/Centos 6-7)</li><li>Design domain with HTTP, SMTP, IMAP, POP3, RPD, PHP, Perl, SFTP</li><li>Troubleshoot and correct laptops, desktops, networks, mobile devices, and electronics Design/Build custom computers</li><li>Hardware Diagnostics (Test & replace faulty parts: RAM, CPU, capacitors, HDD, etc.)</li></ul>",
          "imageName": "jrobcomputers.png",
          "headerRightSubtitle": "Lancaster, SC",
          "headerRightTitle": "2009 - Present",
          "subtitle": "Owner"
        }
      ]
    },
    {
      "sortOrder": 3,
      "sectionName": "Awards",
      "data": [
        {
          "title": "Queen City Hackathon 1st Place",
          "detailsHTML": "<span>24 hour hackathon with over 200 individual participants and $10k prize for 1st place. Submitted a prototype machine learning model to help users estimate healthcare costs prior to visit using crowdsourced healthcare data</span><div><a href=\"https://abdsociety.org/queen-city-hackathon\">Details</a> <a href=\"https://github.com/justin-robinson/clthackathon2017 \">Source Code</a></div>",
          "imageName": "queen-city-hackathon.png",
          "headerRightTitle": "2017"
        }
      ]
    },
    {
      "sortOrder": 4,
      "sectionName": "Skills",
      "data": [
        {
          "title": "Languages",
          "detailsHTML": "Java, JavaScript, Golang, PHP, MySQL, C, node, bash, HTML, CSS"
        },
        {
          "title": "Tools",
          "detailsHTML": "git, Spring, Vue, Laravel, Red Hat/Centos Linux, OSX, IntelliJ, zshell, Sass"
        }
      ]
    }
  ]
}